@Deprecated
public class UserData {

    // Зробимо реєстрацію щоб можна було відслідковувати кроки користувача і збирати статистику
    // для прослуовувань нарпиклад
    // це має бути максимально просто щоб не затягувтаи проект
    // зробити базу даних з користувачем
    // імя
    // нік
    // логін
    // пароль
    // улюьлений гурт
    // також можна це все збергіати через среалізацію
    // для бази використати гібернейт
    // коли юзер логіниться просто зробити перевірку на рівність чи є такий юзер у базі та й все
    // додатково завести зміни які б обраховували кість раз натискання на кнопку play
    // це треба для сатистики, цю інфу зберігати в базі даних
}
