package audioPlayerComp;

/**
 * Цей Enum треба для стандартизації доступу до компонента.
 * Пр: якщо треба отримати компонент з Map, то буде звертатись по Enum
 * і так отримуватимемо саме той компонент який потрібно.
 *
 * Кращою практикую є зробити реєстр, бо він більш гнучкий.
 * А тут доводиться добавляти й видаляти в ручну, а під час рантайму це
 * неможливо зробити взагалі.
 */

enum TypeOfComponent {

    // Деякі з них не потрібні
    PAUSE, STOP, CHANGE_VOLUME, PLAY, SHUFFLE, CHANGE_POSITION;

}
